import React from 'react';

export const MissionPage = () => {
    return (
        <div>
            <section class="section">
                <div class="container">
                    <h1 class="subtitle">ミッション</h1>
                    <h2 class="title">全ての人に理由ある学びを提供する</h2>

                    <p><br/>これが私たちのミッションです。<br/><br/>
                    Searac Studyはこのミッションを達成するための、従来の教育サービスとは一線を画したサービスです。<br/>
                    Searac Studyではスキルマップを使うことで「ゴールにたどり着くには何を学べばよいか」を俯瞰的に分かりやすく学ぶことができます。<br/>
                    一方で、このサービスは個別の技術の詳細には踏み込みません。<br/>
                    これは私たちが「どのように」学ぶかよりも、「何を」「なぜ」学ぶかを重視しているからです。<br/><br/>
                    私たちは、あらゆるユーザーが目標を明確にし、それを実現するために学ぶことを全力でサポートしていきます。<br/><br/>
                    

                    現在のプログラミング教育は「プログラミングのための思考ツールと基礎技術」を提供することにとどまっています。<br/>
                    これから子供たちはプログラミング言語の基礎を学び、簡単なゲームを作れるようになるでしょう。<br/>
                    こういった教育は「IT分野への興味を持たせる一歩」としては一定の成果を収めているように思えます。<br/><br/>

                    しかし、それだけで未来を担うIT人材を育成できるでしょうか？<br/><br/>
                    現在のプログラミング教育システムには2つの弱点があります。<br/><br/>

                    1つ目は地域格差です。<br/>
                    現在、都心部では民間企業が子供たちへのIT教育を支援する動きが見られ、IT教育に大きなリソースがつぎ込まれています。<br/>
                    一方で、全国的には設備の導入や教員の育成等で多くの問題が残っています。<br/>
                    このようなIT教育資源の地域差はAI時代に移り変わりつつある現在においては、これまで以上に深刻な問題になるでしょう。<br/><br/>

                    2つ目は意欲の喪失です。<br/>
                    現在のプログラミング教育のゴールは「簡単なゲームを作る」ことがほとんどです。<br/>
                    これは子供たちに達成感を与えてくれる一方、そこから先の応用が見えなくなり学びが止まりかねません。<br/>
                    ITによる問題解決には学校で学ぶプログラミング以外にも多くの知識・技術を必要とします。</p>
                </div>
            </section>
        </div>
    )
}